#include "items.h"
#include <iostream>
using namespace std;

potion::potion()
{
}

potion::~potion()
{
}

int potion::healing()
{
	return 25; // دي علشان لما الشخصية تستدعاها تزودلها الهيلث بمقدار 25
}

int potion::size()
{
	return -10; // دي بقي علشان لما نستدعي الفانكشن دي في الانفينتوري تنقص 10 من مساحتها
}

poison::poison()
{
}

poison::~poison()
{
}

int poison::damage()
{
	return -15; // دي لما العدو يستدعاها عنده هتنقصله هيله بمقدار -15
}
int poison::size()
{
	return -15; // ودي لما الانفينتوري تستدعاها هتنقص من مساحتها -15
}

shield::shield():health(50)
{
}

shield::~shield()
{
}

// الفانكشن دي بقي كل مهمتها انها تاخد 
// قيمة الهجوم الي هيعمله العدو
//وتعدل علي الهيلث بتاع الدرع

void shield::set_health(int x)//القمية الي بين القوس هتكون قيمة الهجوم الي هيقدمه العدو
{
	health += x ; // هتكون القيمة الي بيقدمها بالسالب فهنضيفها علي هيلث الدرع
}

int shield::size()
{
	return -30; // ده المساحة الي هستهلكها لما الانفينتوري تستدعاها -30
}

weapon::weapon():health(100)
{
}

weapon::~weapon()
{
}

//دي هتكون الضربة الثقيلة وبتاثر علي الدرع لو موجود والهيلث بتاع الشخصية برضو

int weapon::heavy_attack()
{
	health -= 30; // دي علشان لما تضرب الشخصية الي قدامك السلاح بتاعك هيلثه هيقل -30
	return -30; //ودي القيمة الي هترجعها والمفروض تنقص من هيلث او درع العدو
}

//دي هتكون الضربة الخفيفة وبتاثر علي الدرع لو موجود والهيلث بتاع الشخصية برضو

int weapon::melee_attack()
{
	health -= 10; // دي علشان لما تضرب الشخصية الي قدامك السلاح بتاعك هيلثه هيقل -10
	return -10; //ودي القيمة الي هترجعها والمفروض تنقص من هيلث او درع العدو -10
}

// ده الي بيحدد مساحة السلام في الانفينتوري

int weapon::size()
{
	return -40; // دي المساحة الي هينقصها من الانفينتوري -40
}

int weapon::get_health()
{
	return health;
}
